#
# .zsh_plugins.txt - Zsh plugin file
#

# Zsh Benchmarking
romkatv/zsh-bench kind:path

# Enables use of abbreviations (abbr)
olets/zsh-abbr kind:defer

# Local plugins
$ZDOTDIR/plugins path:aliases.zsh

# zsh-utils
belak/zsh-utils path:editor
belak/zsh-utils path:history
belak/zsh-utils path:utility
#belak/zsh-utils path:completion

# oh-my-zsh lib
ohmyzsh/ohmyzsh path:lib/clipboard.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh
#ohmyzsh/ohmyzsh path:lib/completion.zsh
#ohmyzsh/ohmyzsh path:lib/key-bindings.zsh

# oh-my-zsh plugins
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/magic-enter
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/fzf

# Jump around based on directory frequency
skywind3000/z.lua

# Additional completion definitions 
zsh-users/zsh-completions

# fzf based tab completion
Aloxaf/fzf-tab kind:defer

# Syntax highlighting
zdharma-continuum/fast-syntax-highlighting kind:defer

# Real-time type-ahead autocompletion
#marlonrichert/zsh-autocomplete kind:defer

# Suggests commands based on history
zsh-users/zsh-autosuggestions kind:defer
